modulation_choices = (
    ('2-PSK', '2-PSK (Фазовая манипуляция)'),
    ('4-PSK', '4-PSK (Фазовая манипуляция)'),
    ('8-PSK', '8-PSK (Фазовая манипуляция)'),
    ('16-PSK', '16-PSK (Фазовая манипуляция)'),
    ('32-PSK', '32-PSK (Фазовая манипуляция)'),
    ('4-QAM', '4-QAM (Квадратурно-амплитудная манипуляция)'),
    ('16-QAM', '16-QAM (Квадратурно-амплитудная манипуляция)'),
    ('64-QAM', '64-QAM (Квадратурно-амплитудная манипуляция)'),
    ('256-QAM', '256-QAM (Квадратурно-амплитудная манипуляция)'),
)
